In [1]:
import pandas
import numpy
filename = "C:\\Users\\rb027742\\OneDrive\\Documents\\Machine Learning\\Kaggle\\Titanic\\train.csv"

In [2]:
df = pandas.read_csv(filename)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [4]:
del df['Name']
del df['Ticket']
del df['Cabin']
del df['PassengerId']
df.count()

Survived    891
Pclass      891
Sex         891
Age         714
SibSp       891
Parch       891
Fare        891
Embarked    889
dtype: int64

In [5]:
df = pandas.get_dummies(df, columns = ['Sex', 'Pclass', 'Embarked'], drop_first=True)
df.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0,22.0,1,0,7.2500,1,0,1,0,1
1,1,38.0,1,0,71.2833,0,0,0,0,0
2,1,26.0,0,0,7.9250,0,0,1,0,1
3,1,35.0,1,0,53.1000,0,0,0,0,1
4,0,35.0,0,0,8.0500,1,0,1,0,1

In [6]:
df = df.dropna(subset= ['Embarked_Q', 'Embarked_S'] )
df = df.fillna(value=0, axis=1)
df.count()

Survived      891
Age           891
SibSp         891
Parch         891
Fare          891
Sex_male      891
Pclass_2      891
Pclass_3      891
Embarked_Q    891
Embarked_S    891
dtype: int64

In [30]:
from sklearn.model_selection import train_test_split
X = df.as_matrix(columns=['Age', 'SibSp', 'Parch', 'Fare', 'Sex_male', 'Pclass_2', 'Pclass_3', 'Embarked_Q', 'Embarked_S'])
y = df.as_matrix(columns=['Survived'])
y = y.ravel()
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [8]:
from sklearn import linear_model
log_model = linear_model.LogisticRegression(C=10.0)
log_model = log_model.fit(X_train, y_train)

In [9]:
print(log_model.score(X_train, y_train))

0.807584269663

In [10]:
print(log_model.score(X_test, y_test))

0.776536312849

In [11]:
from sklearn import linear_model
log_model = linear_model.LogisticRegression(C=10.0)
log_model = log_model.fit(X, y)

In [12]:
print(log_model.score(X, y))

0.796857463524

In [13]:
vfile = "C:\\Users\\rb027742\\OneDrive\\Documents\\Machine Learning\\Kaggle\\Titanic\\test.csv"
valid = pandas.read_csv(vfile)
valid.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [14]:
valid.count()

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

In [15]:
valid = pandas.get_dummies(valid, columns = ['Sex', 'Pclass', 'Embarked'], drop_first=True)
valid.head()

,PassengerId,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,892,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,1,0,1,1,0
1,893,"Wilkes, Mrs. James (Ellen Needs)",47.0,1,0,363272,7.0000,NaN,0,0,1,0,1
2,894,"Myles, Mr. Thomas Francis",62.0,0,0,240276,9.6875,NaN,1,1,0,1,0
3,895,"Wirz, Mr. Albert",27.0,0,0,315154,8.6625,NaN,1,0,1,0,1
4,896,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",22.0,1,1,3101298,12.2875,NaN,0,0,1,0,1

In [16]:
valid = valid.fillna(value=0, axis=1)
valid.count()

PassengerId    418
Name           418
Age            418
SibSp          418
Parch          418
Ticket         418
Fare           418
Cabin          418
Sex_male       418
Pclass_2       418
Pclass_3       418
Embarked_Q     418
Embarked_S     418
dtype: int64

In [34]:
X_valid = valid.as_matrix(columns=['Age', 'SibSp', 'Parch', 'Fare', 'Sex_male', 'Pclass_2', 'Pclass_3', 'Embarked_Q', 'Embarked_S'])

In [18]:
pfile = "C:\\Users\\rb027742\\OneDrive\\Documents\\Machine Learning\\Kaggle\\Titanic\\test.csv"
pid = pandas.read_csv(pfile)
pid = pid['PassengerId']
pid = pid.ravel()

In [43]:
import csv
with open('Predictions_lg.csv', 'w') as csvfile:
    resultwriter = csv.writer(csvfile, delimiter=',', lineterminator='\n')
    pred = log_model.predict(X_valid)
    for p, i in zip(pred, pid):
        resultwriter.writerow([p, i])

In [25]:
from sklearn.model_selection import GridSearchCV
from sklearn.svm import SVC
svm = SVC()
param_grid = [
  {'C': [1, 10, 100, 1000], 'kernel': ['linear']},
  {'C': [1, 10, 100, 1000], 'gamma': [0.001, 0.0001], 'kernel': ['rbf']},
 ]
clf = GridSearchCV(svm, param_grid, cv=5)
svm_model = clf.fit(X_train, y_train)

In [26]:
print(svm_model.score(X_train, y_train))

0.792134831461

In [27]:
print(svm_model.score(X_test, y_test))

0.776536312849

In [33]:
svc = SVC(C=1.0, gamma='auto', kernel='rbf')
svm_model = svc.fit(X, y)
print(svm_model.score(X, y))

0.886644219978

In [42]:
with open('Predictions_svm.csv', 'w') as csvfile:
    resultwriter = csv.writer(csvfile, delimiter=',', lineterminator='\n')
    pred = svm_model.predict(X_valid)
    for p, i in zip(pred, pid):
        resultwriter.writerow([p, i])

In [36]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(n_estimators=10)
rfc_model = rfc.fit(X_train, y_train)

In [37]:
print(rfc_model.score(X_train, y_train))

0.967696629213

In [38]:
print(rfc_model.score(X_test, y_test))

0.810055865922

In [40]:
rfc_model = rfc.fit(X, y)
print(rfc_model.score(X, y))

0.961840628507

In [41]:
with open('Predictions_rf.csv', 'w') as csvfile:
    resultwriter = csv.writer(csvfile, delimiter=',', lineterminator='\n')
    pred = svm_model.predict(X_valid)
    for p, i in zip(pred, pid):
        resultwriter.writerow([p, i])